Autodesk.Revit.Exceptions.ObjectAccessException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.ObjectAccessException
The exception that is thrown when an operation is denied, e.g. an attempt was made to set a read-only property.